#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-UrhcEqDn5m22b8yJ

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.api_lambdas["initLease"].data.archive_file.source_code: Refreshing...
module.agencies_lambda.data.archive_file.agencies_source: Refreshing...
module.api_lambdas["paymentCollector"].data.archive_file.source_code: Refreshing...
module.api_lambdas["houseOverview"].data.archive_file.source_code: Refreshing...
module.api_lambdas["getHouses"].data.archive_file.source_code: Refreshing...
module.api_lambdas["initLease"].data.archive_file.source_code: Refresh complete after 0s [id=66f8eb07d25c97e7b2c8980dc7d151728270897c]
module.api_lambdas["createHouse"].data.archive_file.source_code: Refreshing...
module.agencies_lambda.data.archive_file.agencies_source: Refresh complete after 0s [id=b8e8dff93783493389ac68438bb9a05cf6abee9e]
module.api_lambdas["houseOverview"].data.archive_file.source_code: Refresh complete after 0s [id=e577589b24b8fbb044463c9d89b1b1122f330187]
module.api_lambdas["getHouses"].data.archive_file.source_code: Refresh complete after 0s [id=3cb83b0323d1ffbeb160f52a21fb516977766d5e]
module.api_lambdas["paymentCollector"].data.archive_file.source_code: Refresh complete after 0s [id=bc2c03be875cc2f88f8a3ad35ee21dd7b18823c3]
module.api_lambdas["createHouse"].data.archive_file.source_code: Refresh complete after 0s [id=25b75e1a5a6cff6b9496ba7c6c10e468b9d0c1e4]
module.maxfrise_api_v2.data.aws_acm_certificate.maxfrise: Refreshing...
module.agencies_lambda.aws_s3_object.agencies_s3_bucket: Refreshing state... [id=agencies_lambda.zip]
module.api_lambdas["paymentCollector"].aws_s3_object.source_s3_bucket: Refreshing state... [id=paymentCollector_lambda.zip]
module.api_lambdas["initLease"].aws_s3_object.source_s3_bucket: Refreshing state... [id=initLease_lambda.zip]
module.api_lambdas["getHouses"].aws_s3_object.source_s3_bucket: Refreshing state... [id=getHouses_lambda.zip]
module.maxfrise_api_v2.data.aws_acm_certificate.maxfrise_test: Refreshing...
module.maxfrise_api_gateway.aws_api_gateway_rest_api.maxfrise_api: Refreshing state... [id=8hbmj9nmrj]
module.iam_maxfrise_lambdas.aws_iam_role.iam_maxfrise_lambdas: Refreshing state... [id=iam_maxfrise_lambdas]
module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test: Refreshing state... [id=agencies-test-table]
module.api_lambdas["createHouse"].aws_s3_object.source_s3_bucket: Refreshing state... [id=createHouse_lambda.zip]
module.api_lambdas["houseOverview"].aws_s3_object.source_s3_bucket: Refreshing state... [id=houseOverview_lambda.zip]
module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod: Refreshing state... [id=agencies-prod-table]
module.maxfrise_user_pool.aws_cognito_user_pool.users_pool: Refreshing state... [id=us-west-2_3oKP9s8K9]
module.agencies_lambda.aws_lambda_function.agencies_lambda: Refreshing state... [id=agencies_lambda]
module.maxfrise_api_gateway.aws_api_gateway_resource.agencies_resource: Refreshing state... [id=udh18b]
module.api_lambdas["initLease"].aws_lambda_function.lambda_function: Refreshing state... [id=initLease_TF]
module.api_lambdas["createHouse"].aws_lambda_function.lambda_function: Refreshing state... [id=createHouse_TF]
module.api_lambdas["getHouses"].aws_lambda_function.lambda_function: Refreshing state... [id=getHouses_TF]
module.api_lambdas["houseOverview"].aws_lambda_function.lambda_function: Refreshing state... [id=houseOverview_TF]
module.api_lambdas["paymentCollector"].aws_lambda_function.lambda_function: Refreshing state... [id=paymentCollector_TF]
module.maxfrise_api_gateway.aws_api_gateway_method.agencies_resource_method: Refreshing state... [id=agm-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_v2.data.aws_acm_certificate.maxfrise_test: Refresh complete after 1s [id=arn:aws:acm:us-west-2:914036813947:certificate/56f07a0b-a2e0-46cc-b89b-e65f04d9f47c]
module.maxfrise_api_v2.aws_api_gateway_domain_name.staging_v2_domain: Refreshing state... [id=staging.apiv2.maxfrise.com]
module.maxfrise_api_v2.data.aws_acm_certificate.maxfrise: Refresh complete after 1s [id=arn:aws:acm:us-west-2:914036813947:certificate/48eb269b-4ebd-40d3-bf94-dded021baf25]
module.maxfrise_api_v2.aws_api_gateway_domain_name.production_v2_domain: Refreshing state... [id=apiv2.maxfrise.com]
module.maxfrise_api_gateway.aws_lambda_permission.agencies_api_lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request: Refreshing state... [id=agi-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_v2.data.template_file.maxfrise_api_v2_spec: Refreshing...
module.maxfrise_api_v2.data.template_file.maxfrise_api_v2_spec: Refresh complete after 0s [id=2015721aa92e16a5b79f518607881598d1b09b12189a02aadae5eeea0b8bea18]
module.maxfrise_api_v2.aws_api_gateway_rest_api.api_v2: Refreshing state... [id=dhp09inpz4]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment: Refreshing state... [id=uq9zi6]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment: Refreshing state... [id=x3fdqk]
module.maxfrise_api_gateway.aws_api_gateway_stage.test: Refreshing state... [id=ags-8hbmj9nmrj-test]
module.maxfrise_api_gateway.aws_api_gateway_stage.prod: Refreshing state... [id=ags-8hbmj9nmrj-prod]
module.maxfrise_api_v2.aws_api_gateway_deployment.test_deployment: Refreshing state... [id=aiuq1w]
module.maxfrise_api_v2.aws_api_gateway_deployment.prod_deployment: Refreshing state... [id=k1y6cv]
module.api_lambdas["paymentCollector"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_lambdas["getHouses"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_lambdas["houseOverview"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_lambdas["initLease"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_lambdas["createHouse"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.maxfrise_api_v2.aws_api_gateway_stage.prod_stage: Refreshing state... [id=ags-dhp09inpz4-prod]
module.maxfrise_api_v2.aws_api_gateway_stage.test_stage: Refreshing state... [id=ags-dhp09inpz4-test]
module.maxfrise_api_v2.aws_api_gateway_base_path_mapping.production_v2_domain: Refreshing state... [id=apiv2.maxfrise.com/]
module.maxfrise_api_v2.aws_api_gateway_base_path_mapping.staging_v2_domain: Refreshing state... [id=staging.apiv2.maxfrise.com/]
module.maxfrise_user_pool.aws_cognito_user_pool.users_pool: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.maxfrise_user_pool.aws_cognito_user_pool.users_pool has been deleted
  - resource "aws_cognito_user_pool" "users_pool" {
      - id                         = "us-west-2_3oKP9s8K9" -> null
        name                       = "maxfrise_users"
        tags                       = {
            "Environment" = "production"
            "Owner"       = "maxfrise"
            "Terraform"   = "true"
        }
        # (16 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.maxfrise_user_pool.aws_cognito_user_pool.users_pool will be created
  + resource "aws_cognito_user_pool" "users_pool" {
      + alias_attributes           = [
          + "email",
        ]
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "ACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "maxfrise_users"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Environment" = "production"
          + "Owner"       = "maxfrise"
          + "Terraform"   = "true"
        }
      + tags_all                   = {
          + "Environment" = "production"
          + "Owner"       = "maxfrise"
          + "Terraform"   = "true"
        }

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config (known after apply)

      + email_configuration {
          + email_sending_account = "COGNITO_DEFAULT"
        }

      + password_policy (known after apply)

      + schema {
          + attribute_data_type      = "Number"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "number_of_properties"
          + required                 = false

          + number_attribute_constraints {
              + max_value = "500"
              + min_value = "0"
            }
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = false
          + name                     = "email"
          + required                 = true

          + string_attribute_constraints {
              + max_length = "2048"
              + min_length = "0"
            }
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = false
          + name                     = "name"
          + required                 = true

          + string_attribute_constraints {
              + max_length = "2048"
              + min_length = "0"
            }
        }

      + sms_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # module.maxfrise_user_pool.aws_cognito_user_pool_client.client[0] will be created
  + resource "aws_cognito_user_pool_client" "client" {
      + access_token_validity                = 1
      + allowed_oauth_flows                  = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client = false
      + allowed_oauth_scopes                 = [
          + "email",
          + "openid",
          + "profile",
        ]
      + auth_session_validity                = 3
      + callback_urls                        = [
          + "https://www.maxfrise.com/callback",
        ]
      + client_secret                        = (sensitive value)
      + default_redirect_uri                 = "https://www.maxfrise.com/callback"
      + enable_token_revocation              = true
      + explicit_auth_flows                  = [
          + "ALLOW_ADMIN_USER_PASSWORD_AUTH",
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + generate_secret                      = false
      + id                                   = (known after apply)
      + id_token_validity                    = 1
      + logout_urls                          = (known after apply)
      + name                                 = "maxfrise_web_client"
      + prevent_user_existence_errors        = "ENABLED"
      + read_attributes                      = [
          + "address",
          + "birthdate",
          + "custom:number_of_properties",
          + "email",
          + "email_verified",
          + "family_name",
          + "gender",
          + "given_name",
          + "locale",
          + "middle_name",
          + "name",
          + "nickname",
          + "phone_number",
          + "phone_number_verified",
          + "picture",
          + "preferred_username",
          + "profile",
          + "updated_at",
          + "website",
          + "zoneinfo",
        ]
      + refresh_token_validity               = 60
      + supported_identity_providers         = [
          + "COGNITO",
        ]
      + user_pool_id                         = (known after apply)
      + write_attributes                     = [
          + "address",
          + "birthdate",
          + "custom:number_of_properties",
          + "email",
          + "family_name",
          + "gender",
          + "given_name",
          + "locale",
          + "middle_name",
          + "name",
          + "nickname",
          + "phone_number",
          + "picture",
          + "preferred_username",
          + "profile",
          + "updated_at",
          + "website",
          + "zoneinfo",
        ]

      + token_validity_units {
          + access_token  = "hours"
          + id_token      = "hours"
          + refresh_token = "days"
        }
    }

  # module.maxfrise_user_pool.aws_cognito_user_pool_domain.domain will be created
  + resource "aws_cognito_user_pool_domain" "domain" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "maxfrise"
      + id                              = (known after apply)
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = (known after apply)
      + version                         = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @saudelog, Action: `pull_request`*